In [1]:
import pandas as pd
df = pd.read_csv("mycsvfile.csv")
df

       Name  age classs grade gender
0    shivam    3   12th     a      f
1     rohit    2    8th     b      m
2    chetan   12    6th     c      m
3   asshish   32    9th     b      m
4     mohit   12   10th     d      m
5   asshmit   12    4th     e      m
6     tahsu    1   12th     a      f
7     priya   23    5th     b      f
8    sweety    4    7th     d      f
9    cheery   35    9th     b      f
10   candy    65    4th     e      f
11    chiku    4    8th     c      m
12    mohit   67    4th     f      m

#  Selecting one column

In [2]:
# select the column by []
df['age']

0      3
1      2
2     12
3     32
4     12
5     12
6      1
7     23
8      4
9     35
10    65
11     4
12    67
Name: age, dtype: int64

In [3]:
# select another column with []
df['classs']

0     12th
1      8th
2      6th
3      9th
4     10th
5      4th
6     12th
7      5th
8      7th
9      9th
10     4th
11     8th
12     4th
Name: classs, dtype: object

In [4]:
# check out the data type of the column
type(df['classs'])

pandas.core.series.Series

In [5]:
type(df['age'])

pandas.core.series.Series

In [6]:
# series: attributes and methods
df['age'].index

RangeIndex(start=0, stop=13, step=1)

In [7]:
df['classs'].head(5)

0    12th
1     8th
2     6th
3     9th
4    10th
Name: classs, dtype: object

# 2. Syntax

In [9]:
# Select the column with .
df.gender

0     f
1     m
2     m
3     m
4     m
5     m
6     f
7     f
8     f
9     f
10    f
11    m
12    m
Name: gender, dtype: object

In [10]:
df.age

0      3
1      2
2     12
3     32
4     12
5     12
6      1
7     23
8      4
9     35
10    65
11     4
12    67
Name: age, dtype: int64

In [11]:
# select the column with . (pitfalls)
df["Name"]

0      shivam
1       rohit
2      chetan
3     asshish
4       mohit
5     asshmit
6       tahsu
7       priya
8      sweety
9      cheery
10     candy
11      chiku
12      mohit
Name: Name, dtype: object

In [14]:
# select the column with using []
df["age"]

0      3
1      2
2     12
3     32
4     12
5     12
6      1
7     23
8      4
9     35
10    65
11     4
12    67
Name: age, dtype: int64